app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`created_at`, `description`, `name`, `updated_at`, `user_id`) VALUES ('2012-09-19 17:49:11', 'dfdfsdfsdfdgdfgdfgdghhf', 'test1', '2012-09-19 17:49:11', NULL)

  def find_post
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1