app/controllers/users_controller.rb

  def create
  	@user = User.new(params[:user])
  	if @user.save
---
INSERT INTO `users` (`created_at`, `crypted_password`, `email`, `login`, `name`, `password_salt`, `persistence_token`, `updated_at`) VALUES ('2012-08-29 05:06:43', '87f3de45d4708e6010ec2615fcdaf78d8bfddadac068cde956be8df961cc58dacda08db2139f4697144dd2e99847789f4f30693af08f23d240891a93fd24f3fe', 'fgfdf@dfs.com', 'fgfd', 'xg', '18hi4adAm7HVUf6qTrK', 'f0938a9f6476adf22dd4d8e4e9ce5de747399d143ade796eb29ddefc63ef3d0ab9489a73c1add1a7963a74f494ce63563004b5675eb77f752604fffe3fe398dd', '2012-08-29 05:06:43')